tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "osrf/simulation"
# Cross-platform C++ Library for asynchronous programming
brew "asio"
# Portable library for importing many well-known 3D model formats
brew "assimp"
# Software library to render fonts
brew "freetype"
# Perl compatible regular expressions library
brew "pcre"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Core application library for C
brew "glib"
# C++ template library for linear algebra
brew "eigen"
# Suite of Sparse Matrix Software
brew "suite-sparse"
# Rich and complete approach to parallelism in C++
brew "tbb"
# Robot Operating System-independent package for logging
brew "console_bridge"
# Lightweight unit testing framework for C
brew "cunit"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Secure Reliable Transport
brew "srt"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# macOS CLI for managing custom icons for files and folders
brew "fileicon"
# GNU awk utility
brew "gawk"
# Git extension for versioning large files
brew "git-lfs"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Library that provides automatic proxy configuration management
brew "libproxy"
# Library of C++ classes for flexible logging
brew "log4cxx"
# HTTP/2 C Library
brew "nghttp2"
# Package for scientific computing with Python
brew "numpy", link: false
# Cross-platform application and UI framework
brew "qt@5"
# Python bindings for v5 of Qt
brew "pyqt@5"
# Toolkit for 3D computer graphics, image processing, and visualization
brew "vtk"
# Open source computer vision library
brew "opencv"
# Development kit for the Java programming language
brew "openjdk@11"
# C++ class libraries for building network and internet-based applications
brew "poco"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Cross-platform application and UI framework
brew "qt"
# Tool to create Python bindings for C and C++ libraries
brew "sip"
# Super fast C++ logging library
brew "spdlog"
# User interface to the TELNET protocol
brew "telnet"
# XML parser
brew "tinyxml"
# Improved tinyxml (in memory efficiency and size)
brew "tinyxml2"
# Internet file retriever
brew "wget"
# Application launcher and productivity software
cask "alfred"
# Terminal emulator mimicking the old cathode display
cask "cool-retro-term"
# Reimagine your terminal
cask "fig"
# Tool to invert scroll direction for physical scroll wheels
cask "unnaturalscrollwheels"
# Compatibility layer to run Windows applications
cask "wine-stable"
# Open-source version of the X.Org X Window System
cask "xquartz"
